БукмекерскаяКонтора/src/Documents/ЗапросНаСнятие/ЗапросНаСнятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаСнятие</name>
  <registerRecords>AccumulationRegister.ЗапросНаСнятие</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСнятия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособСнятия</name>
    <type>
      <types>EnumRef.СпособСнятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СнятиеСДепозита</name>
    <type>
      <types>DocumentRef.СнятиеСДепозита</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/Enums/СпособСнятия/СпособСнятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособСнятия</name>
  <enumValues>
    <name>Карта</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>QIWI</name>
  </enumValues>
  <enumValues>
    <name>WebMoney</name>
  </enumValues>
</mdclass:Enum>

БукмекерскаяКонтора/src/Documents/ЗапросНаСнятие/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СпособСнятияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СпособСнятия.Карта")
	Тогда
		Элементы.НомерТелефона.Видимость = Ложь;
		Элементы.НомерКарты.Видимость = Истина;
	Иначе
		Элементы.НомерТелефона.Видимость = Истина;
		Элементы.НомерКарты.Видимость = Ложь;
	КонецЕсли	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.СпособСнятия = ПредопределенноеЗначение("Перечисление.СпособСнятия.Карта")
	Тогда
		ТекущийОбъект.НомерТелефона = Неопределено;
	Иначе
		ТекущийОбъект.НомерКарты = Неопределено;
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.Объект.СпособСнятия = ПредопределенноеЗначение("Перечисление.СпособСнятия.Карта")
	Тогда
		Элементы.НомерТелефона.Видимость = Ложь;
		Элементы.НомерКарты.Видимость = Истина;
	Иначе
		Если не ЭтаФорма.Объект.СпособСнятия.Пустая()
		Тогда
			Элементы.НомерТелефона.Видимость = Истина;
			Элементы.НомерКарты.Видимость = Ложь;
		КонецЕсли
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		Объект.Игрок = ПараметрыСеанса.Игрок;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ИгрокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ИгрокНачалоВыбораНаСервере(ДанныеВыбора, СтандартнаяОбработка)
	Если (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Игрок))
	Тогда
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.Добавить(ПараметрыСеанса.Игрок);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Элементы.НомерКарты.Видимость
	И СтрДлина(Элементы.НомерКарты.ТекстРедактирования) < 16 Тогда
		Отказ = Истина;
		Сообщить("Поле Номер Карты заполнено неверно или пустое");
	Иначе
		Если Элементы.НомерТелефона.Видимость 
		И (СтрДлина(Элементы.НомерТелефона.ТекстРедактирования) < 11
		ИЛИ Найти(Элементы.НомерТелефона.ТекстРедактирования, "89") <> 1) Тогда
			Отказ = Истина;
			Сообщить("Поле Номер Телефона заполнено неверно или пустое");
		КонецЕсли;
	КонецЕсли
КонецПроцедуры
